Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
lambda-pluginGnomad.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-pluginConsequence.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-queryGTF.data.aws_region.current: Reading...
module.svep[0].module.lambda-queryVCFsubmit.data.aws_partition.current: Reading...
module.svep[0].module.lambda-concatStarter.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-queryGTF.data.aws_partition.current: Reading...
module.svep[0].module.lambda-queryGTF.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-queryGTF.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-queryVCFsubmit.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-updateReferenceFiles.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-pluginGnomad.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.svep[0].module.lambda-queryGTF.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.docker_image_qcFigures_lambda.data.aws_caller_identity.this: Reading...
module.svep[0].module.lambda-concatStarter.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-pluginConsequence.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-pluginClinvar.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.svep[0].module.lambda-pluginGnomad.data.aws_partition.current: Reading...
data.aws_ecr_authorization_token.token: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-initQuery.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-concatStarter.data.aws_partition.current: Reading...
module.svep[0].module.lambda-queryGTF.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.svep[0].module.lambda-concat.data.aws_partition.current: Reading...
module.svep[0].module.lambda-pluginGnomad.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-pluginConsequence.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.svep[0].module.lambda-concat.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-initQuery.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.docker_image_qcFigures_lambda.data.aws_caller_identity.this: Read complete after 0s [id=565393035713]
module.svep[0].module.lambda-concatStarter.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-concatStarter.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.sbeacon.module.lambda-splitQuery.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getGenomicVariants.data.aws_region.current: Reading...
module.sbeacon.module.lambda-generateCohortVCfs.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getGenomicVariants.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-generateCohortVCfs.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.sbeacon.module.python_modules_layer.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getRuns.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-splitQuery.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.sbeacon.module.python_modules_layer.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-deidentifyFiles.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-submitDataset.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-submitDataset.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-deidentifyFiles.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.sbeacon.module.lambda-getInfo.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-submitDataset.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-getFilteringTerms.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getRuns.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.sbeacon.module.lambda-getAnalyses.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getRuns.data.aws_region.current: Reading...
module.sbeacon.module.lambda-submitDataset.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.sbeacon.module.lambda-data-portal.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getProjects.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getRuns.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getAnalyses.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-getFilteringTerms.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-getEntryTypes.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getRuns.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getInfo.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.sbeacon.module.lambda-data-portal.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getDatasets.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getProjects.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.sbeacon.module.lambda-admin.data.aws_region.current: Reading...
module.sbeacon.module.lambda-data-portal.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getConfiguration.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getDatasets.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getDatasets.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getMap.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getEntryTypes.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getRuns.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-data-portal.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.docker_image_submitDataset_lambda.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getIndividuals.data.aws_region.current: Reading...
module.sbeacon.module.lambda-admin.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-updateFiles.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getDatasets.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.sbeacon.module.lambda-updateFiles.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getBiosamples.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getConfiguration.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.sbeacon.module.docker_image_submitDataset_lambda.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getIndividuals.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getBiosamples.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-updateFiles.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getIndividuals.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getIndividuals.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-getMap.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.sbeacon.module.lambda-generateReports.data.aws_region.current: Reading...
module.sbeacon.module.lambda-updateFiles.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.sbeacon.module.lambda-getBiosamples.data.aws_region.current: Reading...
module.sbeacon.module.lambda-generateReports.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getAnalyses.data.aws_region.current: Reading...
module.sbeacon.module.lambda-generateReports.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-generateReports.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.data.aws_iam_policy.AWSGlueServiceRole: Reading...
module.sbeacon.module.lambda-getFilteringTerms.data.aws_caller_identity.current: Reading...
module.sbeacon.module.python_modules_layer.data.aws_caller_identity.current: Reading...
module.sbeacon.data.aws_caller_identity.this: Reading...
module.sbeacon.module.lambda-getBiosamples.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-generateReports.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getGenomicVariants.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getAnalyses.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-generateReports.data.aws_partition.current: Reading...
module.sbeacon.module.python_modules_layer.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.sbeacon.module.lambda-getEntryTypes.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getProjects.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-generateReports.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.sbeacon.module.lambda-getFilteringTerms.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.sbeacon.module.lambda-getEntryTypes.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.sbeacon.module.lambda-getProjects.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-generateReports.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.data.aws_caller_identity.this: Read complete after 0s [id=565393035713]
module.sbeacon.module.lambda-getGenomicVariants.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.sbeacon.module.lambda-getProjects.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getEntryTypes.data.aws_partition.current: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-submitDataset: Reading...
module.sbeacon.module.lambda-getProjects.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getEntryTypes.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.data.aws_iam_policy_document.lambda-submitDataset: Read complete after 0s [id=4273650825]
module.sbeacon.module.lambda-splitQuery.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getIndividuals.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getMap.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-generateCohortVCfs.data.aws_region.current: Reading...
module.sbeacon.module.lambda-splitQuery.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-indexer.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getIndividuals.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.sbeacon.module.lambda-generateCohortVCfs.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-indexer.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getMap.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getMap.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-indexer.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.sbeacon.module.python_modules_layer.data.aws_region.current: Reading...
module.sbeacon.module.lambda-indexer.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getMap.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-deidentifyFiles.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-deidentifyFiles.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.python_modules_layer.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getBiosamples.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-deidentifyFiles.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getBiosamples.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.sbeacon.module.lambda-deidentifyFiles.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getInfo.data.aws_region.current: Reading...
module.sbeacon.module.lambda-submitDataset.data.aws_region.current: Reading...
module.sbeacon.module.lambda-performQuery.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getInfo.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-submitDataset.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.data.aws_iam_policy_document.lambda-performQuery: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-performQuery: Read complete after 0s [id=3620005588]
module.sbeacon.module.lambda-performQuery.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.sbeacon.module.lambda-getConfiguration.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getConfiguration.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-splitQuery.data.aws_region.current: Reading...
module.sbeacon.module.lambda-admin.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getAnalyses.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getAnalyses.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.sbeacon.module.lambda-admin.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-performQuery.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-splitQuery.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-admin.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-performQuery.data.aws_partition.current: Read complete after 1s [id=aws]
module.sbeacon.module.lambda-admin.data.aws_caller_identity.current: Read complete after 1s [id=565393035713]
module.sbeacon.module.lambda-updateFiles.data.aws_partition.current: Reading...
module.sbeacon.data.aws_ecr_authorization_token.token: Reading...
module.sbeacon.module.lambda-getFilteringTerms.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getFilteringTerms.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getConfiguration.data.aws_region.current: Reading...
module.sbeacon.module.lambda-indexer.data.aws_partition.current: Reading...
module.sbeacon.data.aws_iam_policy_document.glue: Reading...
module.sbeacon.module.lambda-getInfo.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-updateFiles.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-indexer.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-getInfo.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.data.aws_iam_policy_document.glue: Read complete after 0s [id=2681768870]
module.sbeacon.data.aws_iam_policy_document.sagemaker_jupyter_instance_policy: Reading...
module.sbeacon.module.lambda-getDatasets.data.aws_partition.current: Reading...
module.sbeacon.data.aws_ecr_authorization_token.token: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getDatasets.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.data.aws_iam_policy_document.sagemaker_jupyter_instance_policy: Read complete after 0s [id=1147345228]
module.sbeacon.module.docker_image_submitDataset_lambda.data.aws_caller_identity.this: Reading...
module.sbeacon.module.lambda-generateCohortVCfs.data.aws_partition.current: Reading...
module.sbeacon.data.aws_iam_policy_document.ec2_assume_role_policy: Reading...
module.sbeacon.module.lambda-getConfiguration.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.docker_image_submitDataset_lambda.data.aws_caller_identity.this: Read complete after 0s [id=565393035713]
module.sbeacon.data.aws_iam_policy_document.ec2_assume_role_policy: Read complete after 0s [id=2851119427]
module.sbeacon.module.lambda-generateCohortVCfs.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-getGenomicVariants.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-data-portal.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-performQuery.data.aws_region.current: Reading...
module.sbeacon.module.lambda-data-portal.data.aws_caller_identity.current: Read complete after 0s [id=565393035713]
module.sbeacon.module.lambda-getGenomicVariants.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.data.aws_iam_policy_document.main-apigateway: Reading...
module.sbeacon.module.lambda-performQuery.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.data.aws_iam_policy_document.main-apigateway: Read complete after 0s [id=2699642182]
module.webgui.data.aws_cloudfront_cache_policy.bui-s3-distribution-cache-policy: Read complete after 1s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
module.sbeacon.module.lambda-getBiosamples.data.aws_iam_policy_document.assume_role[0]: Reading...
module.cognito.module.lambda-sendRegistrationEmail.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getBiosamples.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.cognito.module.lambda-sendRegistrationEmail.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-clearTempAndRegions.data.aws_iam_policy_document.assume_role[0]: Reading...
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-clearTempAndRegions.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getConfiguration.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getIndividuals.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-qcFigures.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getIndividuals.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-admin.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getConfiguration.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-qcFigures.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-admin.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-updateFiles.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-updateFiles.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.security.data.aws_iam_policy_document.lambda-sendSecurityAlert: Reading...
module.security.data.aws_iam_policy_document.lambda-sendSecurityAlert: Read complete after 0s [id=2416217652]
module.sbeacon.module.lambda-indexer.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-indexer.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getDatasets.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getDatasets.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.data.aws_iam_policy.AWSGlueServiceRole: Read complete after 2s [id=arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole]
module.sbeacon.data.aws_iam_policy_document.lambda-generateReports: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-generateReports: Read complete after 0s [id=2952767276]
module.sbeacon.module.lambda-getMap.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getProjects.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-performQuery.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getMap.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-performQuery.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-data-portal.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getProjects.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getRuns.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getEntryTypes.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-data-portal.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getRuns.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getFilteringTerms.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getEntryTypes.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-deidentifyFiles.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getAnalyses.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getAnalyses.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-generateCohortVCfs.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getInfo.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-splitQuery.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-submitDataset.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getFilteringTerms.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getGenomicVariants.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-deidentifyFiles.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getGenomicVariants.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getInfo.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-generateCohortVCfs.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-splitQuery.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-submitDataset.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-pluginConsequence.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-updateReferenceFiles.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-pluginConsequence.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-updateReferenceFiles.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-initQuery.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-getResultsURL.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-initQuery.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=4087978593]
module.svep[0].module.lambda-formatOutput.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-getResultsURL.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1739087383]
module.svep[0].module.lambda-sendJobEmail.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-formatOutput.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2029117398]
module.svep[0].module.lambda-createPages.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-sendJobEmail.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1338666727]
module.svep[0].module.lambda-queryGTF.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-createPages.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3241676747]
module.svep[0].module.lambda-concatPages.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-queryGTF.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=933168117]
module.svep[0].module.lambda-concatPages.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2646960932]
module.svep[0].module.lambda-pluginGnomad.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-queryVCF.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-queryVCFsubmit.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-pluginClinvar.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-queryVCFsubmit.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3393935751]
module.svep[0].module.lambda-pluginClinvar.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=4067032843]
module.svep[0].module.lambda-pluginGnomad.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=4243848183]
module.svep[0].module.lambda-queryVCF.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3639287297]
module.svep[0].module.lambda-concatStarter.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-concatStarter.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=4243637586]
module.svep[0].module.lambda-concat.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-concat.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3935123696]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.cognito.data.aws_iam_policy_document.admin_group_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "admin_group_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_authenticated will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "gaspi_authenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_unauthenticated will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "gaspi_unauthenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "unauthenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.lambda-sendRegistrationEmail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-sendRegistrationEmail" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ses:SendEmail",
            ]
          + resources = [
              + "arn:aws:ses:ap-southeast-3:565393035713:identity/*",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + resources = [
              + "arn:aws:ssm:ap-southeast-3:565393035713:parameter/bui-ssm-beacon-ui-url",
            ]
        }
    }

  # module.cognito.data.aws_iam_policy_document.lambda-sendSvepJobEmail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-sendSvepJobEmail" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ses:SendEmail",
            ]
          + resources = [
              + "arn:aws:ses:ap-southeast-3:565393035713:identity/*",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + resources = [
              + "arn:aws:ssm:ap-southeast-3:565393035713:parameter/bui-ssm-beacon-ui-url",
            ]
        }
    }

  # module.cognito.data.aws_iam_policy_document.manager_group_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "manager_group_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.ses-sns-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ses-sns-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowSESToPublishToSNS"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "565393035713",
                ]
              + variable = "aws:SourceAccount"
            }

          + principals {
              + identifiers = [
                  + "ses.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.cognito.aws_cognito_identity_pool.gaspi_identity_pool will be created
  + resource "aws_cognito_identity_pool" "gaspi_identity_pool" {
      + allow_classic_flow               = false
      + allow_unauthenticated_identities = false
      + arn                              = (known after apply)
      + id                               = (known after apply)
      + identity_pool_name               = "gaspi-users"
      + tags                             = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tags_all                         = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }

      + cognito_identity_providers {
          + client_id               = (known after apply)
          + provider_name           = (known after apply)
          + server_side_token_check = false
        }
    }

  # module.cognito.aws_cognito_identity_pool_roles_attachment.gaspi_cognito_roles will be created
  + resource "aws_cognito_identity_pool_roles_attachment" "gaspi_cognito_roles" {
      + id               = (known after apply)
      + identity_pool_id = (known after apply)
      + roles            = (known after apply)

      + role_mapping {
          + ambiguous_role_resolution = "AuthenticatedRole"
          + identity_provider         = (known after apply)
          + type                      = "Token"
        }
    }

  # module.cognito.aws_cognito_user.admin will be created
  + resource "aws_cognito_user" "admin" {
      + attributes            = {
          + "email"          = "admin@example.com"
          + "email_verified" = "true"
          + "family_name"    = "Admin"
          + "given_name"     = "Admin"
          + "terraform"      = "true"
        }
      + creation_date         = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + last_modified_date    = (known after apply)
      + mfa_setting_list      = (known after apply)
      + password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      + status                = (known after apply)
      + sub                   = (known after apply)
      + user_pool_id          = (known after apply)
      + username              = "admin@example.com"
    }

  # module.cognito.aws_cognito_user.guest will be created
  + resource "aws_cognito_user" "guest" {
      + attributes            = {
          + "email"          = "guest@example.com"
          + "email_verified" = "true"
          + "family_name"    = "Guest"
          + "given_name"     = "Guest"
          + "terraform"      = "true"
        }
      + creation_date         = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + last_modified_date    = (known after apply)
      + mfa_setting_list      = (known after apply)
      + password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      + status                = (known after apply)
      + sub                   = (known after apply)
      + user_pool_id          = (known after apply)
      + username              = "guest@example.com"
    }

  # module.cognito.aws_cognito_user_group.admin_group will be created
  + resource "aws_cognito_user_group" "admin_group" {
      + description  = "Group of users who can has admin privileges"
      + id           = (known after apply)
      + name         = "administrators"
      + precedence   = 1
      + role_arn     = (known after apply)
      + user_pool_id = (known after apply)
    }

  # module.cognito.aws_cognito_user_group.manager_group will be created
  + resource "aws_cognito_user_group" "manager_group" {
      + description  = "Group of users who can has management privileges"
      + id           = (known after apply)
      + name         = "managers"
      + precedence   = 2
      + role_arn     = (known after apply)
      + user_pool_id = (known after apply)
    }

  # module.cognito.aws_cognito_user_in_group.admin_in_admin_group will be created
  + resource "aws_cognito_user_in_group" "admin_in_admin_group" {
      + group_name   = "administrators"
      + id           = (known after apply)
      + user_pool_id = (known after apply)
      + username     = "admin@example.com"
    }

  # module.cognito.aws_cognito_user_pool.gaspi_user_pool will be created
  + resource "aws_cognito_user_pool" "gaspi_user_pool" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OPTIONAL"
      + name                       = "gaspi-users"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tags_all                   = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + user_pool_tier             = (known after apply)

      + account_recovery_setting {
          + recovery_mechanism {
              + name     = "verified_email"
              + priority = 1
            }
        }

      + admin_create_user_config {
          + allow_admin_create_user_only = true
        }

      + email_configuration {
          + configuration_set     = "ses-feedback-config"
          + email_sending_account = "DEVELOPER"
          + from_email_address    = "devops@xapiens.id"
          + source_arn            = "arn:aws:ses:ap-southeast-3:565393035713:identity/devops@xapiens.id"
        }

      + lambda_config {
          + custom_message       = (known after apply)
          + pre_token_generation = (known after apply)

          + pre_token_generation_config (known after apply)
        }

      + password_policy {
          + minimum_length                   = 8
          + require_lowercase                = true
          + require_numbers                  = true
          + require_symbols                  = true
          + require_uppercase                = true
          + temporary_password_validity_days = 7
        }

      + schema {
          + attribute_data_type      = "Boolean"
          + developer_only_attribute = false
          + mutable                  = false
          + name                     = "terraform"
          + required                 = false
        }
      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "identity_id"
          + required                 = false

          + string_attribute_constraints {
                # (2 unchanged attributes hidden)
            }
        }

      + sign_in_policy (known after apply)

      + sms_configuration (known after apply)

      + software_token_mfa_configuration {
          + enabled = true
        }

      + username_configuration (known after apply)

      + verification_message_template (known after apply)
    }

  # module.cognito.aws_cognito_user_pool_client.gaspi_user_pool_client will be created
  + resource "aws_cognito_user_pool_client" "gaspi_user_pool_client" {
      + access_token_validity                         = 5
      + allowed_oauth_flows                           = (known after apply)
      + allowed_oauth_flows_user_pool_client          = (known after apply)
      + allowed_oauth_scopes                          = (known after apply)
      + auth_session_validity                         = 3
      + callback_urls                                 = (known after apply)
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = (known after apply)
      + explicit_auth_flows                           = [
          + "ALLOW_ADMIN_USER_PASSWORD_AUTH",
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_PASSWORD_AUTH",
        ]
      + id                                            = (known after apply)
      + id_token_validity                             = 5
      + logout_urls                                   = (known after apply)
      + name                                          = "gaspi-users-client"
      + prevent_user_existence_errors                 = (known after apply)
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = 2
      + supported_identity_providers                  = (known after apply)
      + user_pool_id                                  = (known after apply)
      + write_attributes                              = (known after apply)

      + token_validity_units {
          + access_token  = "minutes"
          + id_token      = "minutes"
          + refresh_token = "hours"
        }
    }

  # module.cognito.aws_iam_policy.admin_group_role_policy will be created
  + resource "aws_iam_policy" "admin_group_role_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "admin group permissions"
      + id               = (known after apply)
      + name             = "gaspi-admin-group-role-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gasi-dataportal-*/projects/*"
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Condition = {
                          + StringLike = {
                              + "s3:prefix" = [
                                  + "private/${cognito-identity.amazonaws.com:sub}/",
                                  + "private/${cognito-identity.amazonaws.com:sub}/*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:s3:::gasi-dataportal-*"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gasi-dataportal-*/private/${cognito-identity.amazonaws.com:sub}/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
    }

  # module.cognito.aws_iam_policy.manager_group_role_policy will be created
  + resource "aws_iam_policy" "manager_group_role_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "manager group permissions"
      + id               = (known after apply)
      + name             = "gaspi-manager-group-role-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gasi-dataportal-*/projects/*"
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Condition = {
                          + StringLike = {
                              + "s3:prefix" = [
                                  + "private/${cognito-identity.amazonaws.com:sub}/",
                                  + "private/${cognito-identity.amazonaws.com:sub}/*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:s3:::gasi-dataportal-*"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gasi-dataportal-*/private/${cognito-identity.amazonaws.com:sub}/*"
                    },
                  + {
                      + Action   = "pricing:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
    }

  # module.cognito.aws_iam_role.admin_group_role will be created
  + resource "aws_iam_role" "admin_group_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi-admin-group-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cognito.aws_iam_role.gaspi_authenticated will be created
  + resource "aws_iam_role" "gaspi_authenticated" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi_authenticated"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cognito.aws_iam_role.gaspi_unauthenticated will be created
  + resource "aws_iam_role" "gaspi_unauthenticated" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi_unauthenticated"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cognito.aws_iam_role.manager_group_role will be created
  + resource "aws_iam_role" "manager_group_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi-manager-group-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cognito.aws_iam_role_policy.gaspi_authenticated will be created
  + resource "aws_iam_role_policy" "gaspi_authenticated" {
      + id          = (known after apply)
      + name        = "authenticated_policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Condition = {
                          + StringLike = {
                              + "s3:prefix" = [
                                  + "private/${cognito-identity.amazonaws.com:sub}/",
                                  + "private/${cognito-identity.amazonaws.com:sub}/*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:s3:::gasi-dataportal-*"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gasi-dataportal-*/private/${cognito-identity.amazonaws.com:sub}/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.cognito.aws_iam_role_policy.gaspi_unauthenticated will be created
  + resource "aws_iam_role_policy" "gaspi_unauthenticated" {
      + id          = (known after apply)
      + name        = "unauthenticated_policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "*"
                      + Effect   = "Deny"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.cognito.aws_iam_role_policy_attachment.admin_group_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "admin_group_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "gaspi-admin-group-role"
    }

  # module.cognito.aws_iam_role_policy_attachment.manager_group_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "manager_group_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "gaspi-manager-group-role"
    }

  # module.cognito.aws_lambda_permission.SNSemailNotification will be created
  + resource "aws_lambda_permission" "SNSemailNotification" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "CognitoBackendAllowSNSemailNotificationInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.cognito.aws_lambda_permission.customMessageLambdaTrigger will be created
  + resource "aws_lambda_permission" "customMessageLambdaTrigger" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "cognito-idp.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SBeaconBackendAllowCustomMessageLambdaTriggerInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.cognito.aws_ses_configuration_set.ses_feedback_config will be created
  + resource "aws_ses_configuration_set" "ses_feedback_config" {
      + arn                        = (known after apply)
      + id                         = (known after apply)
      + last_fresh_start           = (known after apply)
      + name                       = "ses-feedback-config"
      + reputation_metrics_enabled = false
      + sending_enabled            = true
    }

  # module.cognito.aws_ses_event_destination.ses_feedback_event_destination will be created
  + resource "aws_ses_event_destination" "ses_feedback_event_destination" {
      + arn                    = (known after apply)
      + configuration_set_name = "ses-feedback-config"
      + enabled                = true
      + id                     = (known after apply)
      + matching_types         = [
          + "bounce",
          + "complaint",
          + "delivery",
        ]
      + name                   = "ses-feedback-event-destination"

      + sns_destination {
          + topic_arn = (known after apply)
        }
    }

  # module.cognito.aws_ses_identity_notification_topic.bounce will be created
  + resource "aws_ses_identity_notification_topic" "bounce" {
      + id                       = (known after apply)
      + identity                 = "devops@xapiens.id"
      + include_original_headers = true
      + notification_type        = "Bounce"
      + topic_arn                = (known after apply)
    }

  # module.cognito.aws_ses_identity_notification_topic.complaint will be created
  + resource "aws_ses_identity_notification_topic" "complaint" {
      + id                       = (known after apply)
      + identity                 = "devops@xapiens.id"
      + include_original_headers = true
      + notification_type        = "Complaint"
      + topic_arn                = (known after apply)
    }

  # module.cognito.aws_ses_identity_notification_topic.delivery will be created
  + resource "aws_ses_identity_notification_topic" "delivery" {
      + id                       = (known after apply)
      + identity                 = "devops@xapiens.id"
      + include_original_headers = true
      + notification_type        = "Delivery"
      + topic_arn                = (known after apply)
    }

  # module.cognito.aws_sns_topic.sesDeliveryLogger will be created
  + resource "aws_sns_topic" "sesDeliveryLogger" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "sesDeliveryLogger"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tracing_config              = (known after apply)
    }

  # module.cognito.aws_sns_topic_policy.sesDeliveryLogger will be created
  + resource "aws_sns_topic_policy" "sesDeliveryLogger" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
    }

  # module.cognito.aws_sns_topic_subscription.sesDeliveryLogger will be created
  + resource "aws_sns_topic_subscription" "sesDeliveryLogger" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.sbeacon.data.archive_file.binaries_layer will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "binaries_layer" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "sbeacon/binaries.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "sbeacon/layers/binaries/"
      + type                = "zip"
    }

  # module.sbeacon.data.aws_iam_policy_document.admin-lambda-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "admin-lambda-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "cognito-idp:*",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.athena-full-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "athena-full-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "athena:GetQueryExecution",
              + "athena:GetQueryResults",
              + "athena:StartQueryExecution",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "glue:*",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.athena-readonly-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "athena-readonly-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "athena:GetQueryExecution",
              + "athena:GetQueryResults",
              + "athena:StartQueryExecution",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "glue:*",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "data-portal-lambda-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:U
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.